app/controllers/users_controller.rb

  def index
      @users = User.where.not("id = ?",current_user.id).order("created_at DESC")
---
SELECT  "users".* FROM "users" WHERE ((LOWER(users.email) LIKE 'options%' OR LOWER(users.username) LIKE 'options%' OR LOWER(users.rolable_type) LIKE 'options%' OR LOWER(users.provider_type) LIKE 'options%' OR LOWER(users.business_activity) LIKE 'options%' OR LOWER(users.ceo_name) LIKE 'options%' OR LOWER(users.nature_of_financing) LIKE 'options%' OR LOWER(users.nature_of_funding) LIKE 'options%' OR LOWER(users.other_support_sought) LIKE 'options%' OR LOWER(users.other_support_offered) LIKE 'options%'))  ORDER BY users.created_at desc LIMIT 1 OFFSET 0